TomAs-1226/Bezel/tab5/sdkconfig.defaults
# Catalyst Tab on the M5Stack Tab5. Values follow M5Stack's own Tab5 demo where it has one
# (docs/tab5-hardware.md); the rest are this firmware's choices.

CONFIG_IDF_TARGET="esp32p4"
# Tab5 units are silicon v1.x: 360 MHz, and an image built for v3.x won't run on them
CONFIG_ESP32P4_REV_MIN_1=y
# ESP-IDF 5.5.3 and later target v3 silicon unless told otherwise (5.5.1 doesn't know this symbol)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 32 MB PSRAM in the package: hex mode at 200 MHz, as the Tab5 BSP and M5Stack's firmware run it. At
# 80 MHz the DPI controller can't fetch the frame buffer in time on a real unit ("underrun happens"
# every frame): a stuttering, cyan-flashing picture and a UI that never gets a frame out. Code executes
# from it too.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
# the 32 MB memory test takes most of a second at every start
CONFIG_SPIRAM_MEMTEST=n
# Internal SRAM (768 KB) is the scarce memory, PSRAM (32 MB) the plentiful one: anything over 512 bytes
# that doesn't ask for DMA or internal memory goes to PSRAM, lwIP's buffers go there, and static buffers
# may be placed there (EXT_RAM_BSS_ATTR)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# LVGL reads tab5/lv_conf.h (passed as LV_CONF_PATH), not Kconfig
CONFIG_LV_CONF_SKIP=n
# LVGL's PPA draw unit checks the Kconfig value (lv_conf.h sets the one LVGL uses): the L2 cache line
CONFIG_LV_DRAW_BUF_ALIGN=128

# The Tab5 BSP: three DPI frame buffers: one on the glass, one waiting for vsync, one free, so a frame's
# work never waits for the last one to be shown (hal_present); the renderer drives the panel itself, so
# the BSP's LVGL port stays unused
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n

# The ESP32-C6 over SDIO (esp_hosted host, matching the C6's stock esp-hosted 1.4.x slave)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# 20 MHz, not 40: at 40 the C6 went on reporting "connected" while nothing got through, a few minutes into
# any real traffic (DNS, TLS), and stopped answering RPCs; a UI doesn't need the speed
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=20000
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
# fixed 1.5 KB receive packets from the pool: streaming mode grows one contiguous internal-DMA buffer to
# whatever is pending, and a scan's results asked for more than internal RAM had (assert in sdio_rx_get_buffer)
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE=y

# robot.local (Systemcore) and roborio-TEAM-frc.local resolve through mDNS
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
CONFIG_LWIP_MAX_SOCKETS=16
# Two segments in flight toward the tablet, not four: a download's burst (The Blue Alliance's match lists)
# jammed the SDIO receive path between the C6 (esp-hosted 1.4.1) and the P4 for good, DNS and the C6's
# own RPC replies with it. Throughput hardly matters for an API client.
CONFIG_LWIP_TCP_WND_DEFAULT=2880
# Two interfaces (Wi-Fi and the USB tether) both run DHCP clients, and lwIP keeps one global DNS server
# list: without this, a lease from Systemcore's dnsmasq would replace the Wi-Fi network's DNS and the
# assistant could no longer resolve api.anthropic.com. With it, DNS follows the default netif (Wi-Fi).
CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF=y

# HTTPS for the assistant: every mbedTLS allocation (the 16 KB record buffers, the handshake) in PSRAM, so
# a TLS session leaves internal RAM to Wi-Fi, USB and the task stacks; the full CA bundle in flash for
# esp_crt_bundle_attach (~65 KB, and no guessing which root a CDN moves to)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# AES in software: the hardware AES works by DMA, and with every TLS buffer in PSRAM it asks for DMA-capable
# PSRAM the heap doesn't hand out ("Failed to allocate memory for start alignment buffer", then
# mbedtls_ctr_drbg_seed -0x0001): every HTTPS request failed before it began. SHA stays in hardware.
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# The USB tether: the enumeration filter lets a Realtek adapter come up in its CDC-ECM configuration;
# RNDIS control responses (OID queries) are up to 1025 bytes, and iot_usbh_rndis refuses to build with
# iot_usbh_cdc's default 256-byte control buffer
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y
CONFIG_USBH_CDC_CONTROL_TRANSFER_BUFFER_SIZE=1025

# IRAM and the small-data section share the 183 KB below 0x4FF2CBD0 (sram_low), and LVGL's
# LV_ATTRIBUTE_FAST_MEM loops already take ~67 KB of it; the USB host's DWC interrupt path (~1.8 KB, always
# in IRAM) overflowed it. Heap functions and ISR-side event posting move to flash instead: nothing in this
# firmware allocates memory or posts an event from an IRAM-safe interrupt while the cache is off.
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
# The LP core's RTC RAM stays out of the heap: handed out as internal memory, ESP-SR's wake word put its
# buffers there and its PIE vector stores fault on it (a crash the moment the companion listened).
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=n

# Camera: SC2356 driven as SC202CS, 1280x720 RAW8 through the ISP
CONFIG_CAMERA_SC202CS=y
CONFIG_CAMERA_SC202CS_MIPI_RAW8_1280X720_30FPS=y
CONFIG_CAMERA_SC202CS_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS=y
# The ISP pipeline controller: auto exposure, white balance, colour correction and the rest of the sensor's
# IPA tuning (esp_ipa, SC202CS's default JSON). Without it the picture came out dark and green. Its task
# runs only while the camera streams, and never writes NVS: its stack goes in PSRAM.
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ISP_PIPELINE_CONTROLLER_TASK_STACK_USE_PSRAM=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096

# A crash leaves a core dump in flash; the next start reads its summary (task, address) onto the boot
# screen and into <sd>/catalyst-boot.txt, then erases it
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# The log on the USB-C port (USB-Serial/JTAG) as the primary console: UART0 at 115200 busy-waits ~6 ms a line
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# The companion's wake word (ESP-SR WakeNet9, hal_tab5_audio.c): "Hi, ESP" only. No speech-command
# models (MultiNet): the phrase after the wake word goes to OpenAI.
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y
